In [14]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sb

In [15]:
df=pd.read_csv('lab8.csv')
df.head()

   Age  EstimatedSalary  Purchased
0   19            19000          0
1   35            20000          0
2   26            43000          0
3   27            57000          0
4   19            76000          0

In [16]:
x=df.iloc[:,[0,1]]
x.head()

   Age  EstimatedSalary
0   19            19000
1   35            20000
2   26            43000
3   27            57000
4   19            76000

In [17]:
y=df.iloc[:,2]
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [18]:
from sklearn.model_selection import train_test_split
from sklearn.svm import SVC
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=.40,random_state=1)

In [19]:
print('Training data : ',xtrain.shape)

Training data :  (240, 2)

In [20]:
print('Testing data : ',xtest.shape)

Testing data :  (160, 2)

In [21]:
xtrain.head()

     Age  EstimatedSalary
163   35            38000
247   57           122000
378   41            87000
145   24            89000
251   37            52000

In [22]:
xtest.head()

     Age  EstimatedSalary
398   36            33000
125   39            61000
328   36           118000
339   39           122000
172   26           118000

In [23]:
ytrain.head()

163    0
247    1
378    1
145    0
251    0
Name: Purchased, dtype: int64

In [24]:
model=SVC(gamma='auto')

In [25]:
model.fit(xtrain,ytrain)

SVC(gamma='auto')

In [26]:
model.score(xtest,ytest)

0.66875